In [2]:
import pandas as pd

In [4]:
#import train dataset
i=pd.read_csv('Intern.csv')

In [6]:
#snapchat
i.head()

,movieId,title,genres,userId,movieId.1,tag,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,2.0,60756.0,funny,1.445715e+09
1,2,Jumanji (1995),Adventure|Children|Fantasy,2.0,60756.0,Highly quotable,1.445715e+09
2,3,Grumpier Old Men (1995),Comedy|Romance,2.0,60756.0,will ferrell,1.445715e+09
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance,2.0,89774.0,Boxing story,1.445715e+09
4,5,Father of the Bride Part II (1995),Comedy,2.0,89774.0,MMA,1.445715e+09

In [8]:
subset=i[['title','genres']]
subset.head()

,title,genres
0,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,Jumanji (1995),Adventure|Children|Fantasy
2,Grumpier Old Men (1995),Comedy|Romance
3,Waiting to Exhale (1995),Comedy|Drama|Romance
4,Father of the Bride Part II (1995),Comedy

In [11]:
i.shape

(9742, 7)

In [15]:
i.describe()

             movieId       userId      movieId.1     timestamp
count    9742.000000  3683.000000    3683.000000  3.683000e+03
mean    42200.353623   431.149335   27252.013576  1.320032e+09
std     52160.494854   158.472553   43490.558803  1.721025e+08
min         1.000000     2.000000       1.000000  1.137179e+09
25%      3248.250000   424.000000    1262.500000  1.137521e+09
50%      7300.000000   474.000000    4454.000000  1.269833e+09
75%     76232.000000   477.000000   39263.000000  1.498457e+09
max    193609.000000   610.000000  193565.000000  1.537099e+09

In [17]:
i.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9742 entries, 0 to 9741
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   movieId    9742 non-null   int64
 1   title      9742 non-null   object
 2   genres     9742 non-null   object
 3   userId     3683 non-null   float64
 4   movieId.1  3683 non-null   float64
 5   tag        3683 non-null   object
 6   timestamp  3683 non-null   float64
dtypes: float64(3), int64(1), object(3)
memory usage: 418.7+ KB

In [19]:
i.isnull()

      movieId  title  genres  userId  movieId.1    tag  timestamp
0       False  False   False   False      False  False      False
1       False  False   False   False      False  False      False
2       False  False   False   False      False  False      False
3       False  False   False   False      False  False      False
4       False  False   False   False      False  False      False
...       ...    ...     ...     ...        ...    ...        ...
9737    False  False   False    True       True   True       True
9738    False  False   False    True       True   True       True
9739    False  False   False    True       True   True       True
9740    False  False   False    True       True   True       True
9741    False  False   False    True       True   True       True

[9742 rows x 7 columns]

In [22]:
i.isnull().sum()

movieId         0
title           0
genres          0
userId       6059
movieId.1    6059
tag          6059
timestamp    6059
dtype: int64

In [24]:
i.isnull().sum()/9742

movieId      0.000000
title        0.000000
genres       0.000000
userId       0.621946
movieId.1    0.621946
tag          0.621946
timestamp    0.621946
dtype: float64


# MISSING DATA

In [27]:
import numpy as np
import pandas as pd

In [33]:
df=pd.DataFrame({'A':[1,2,np.nan],
                 'B':[5,np.nan,np.nan],
                 'C':[1,2,3]})

In [35]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [37]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [39]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [46]:
df.fillna(value="ok")

    A   B  C
0   1   5  1
1   2  ok  2
2  ok  ok  3

In [48]:
i['userId'].median()

474.0

#back to analysis

In [49]:
 i['tag'].value_counts()

In Netflix queue     131
atmospheric           36
superhero             24
thought-provoking     24
Disney                23
                    ...
Journalism             1
royal with cheese      1
southern US            1
sophisticated          1
Emma                   1
Name: tag, Length: 1589, dtype: int64

In [50]:
i.groupby('movieId.1').mean()

               movieId  userId     timestamp
movieId.1
1.0        1981.333333   459.0  1.267180e+09
2.0         349.000000   165.0  1.430977e+09
3.0         678.500000   289.0  1.143425e+09
5.0        1284.500000   474.0  1.137374e+09
7.0        1286.000000   474.0  1.137376e+09
...                ...     ...           ...
183611.0    452.000000    62.0  1.526245e+09
184471.0    455.000000    62.0  1.528025e+09
187593.0    458.000000    62.0  1.527274e+09
187595.0    460.500000    62.0  1.528935e+09
193565.0    617.500000   184.0  1.537099e+09

[1572 rows x 3 columns]